app/views/users/index.html.haml

SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "projects" INNER JOIN "projects_users" ON "projects"."id" = "projects_users"."project_id" WHERE "projects_users"."user_id" = ?  [["user_id", 1]]
---
          %td= developer.email
          %td= developer.todos.count
          %td= developer.projects.count