app/views/projects/index.html.haml

SELECT COUNT(*) FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 1]]
---
          %td= project.title
          %td= project.todos.count