app/views/dashboards/_index.html.haml

          .col-lg-4.col-md-4.col-xs-12.thumb
            - if project.todos.present?
---
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (?, ?, ?, ?, ?, ?)  [["project_id", 1], ["project_id", 2], ["project_id", 3], ["project_id", 4], ["project_id", 5], ["project_id", 6]]