app/controllers/dashboards_controller.rb

SELECT "projects".* FROM "projects"
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (?, ?, ?, ?, ?, ?)  [["project_id", 1], ["project_id", 2], ["project_id", 3], ["project_id", 4], ["project_id", 5], ["project_id", 6]]
---
  def index
    @projects = Project.includes(:todos).all