app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Android"], ["created_at", "2019-08-09 05:40:16.610826"], ["updated_at", "2019-08-09 05:40:16.610826"]]