app/controllers/todos_controller.rb

  def create
    @todo = @project.todos.new(todo_params)
    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("description", "status", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Grid system · Bootstrap"], ["status", 0], ["user_id", 1], ["project_id", 1], ["created_at", "2019-08-09 06:18:50.646297"], ["updated_at", "2019-08-09 06:18:50.646297"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "status" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["status", 2], ["updated_at", "2019-08-10 07:56:50.257408"], ["id", 10]]

    def find_project
      @project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]