app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    if current_user.admin?
      @todos = @user.todos.includes(:project).order(created_at: :desc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? ORDER BY "todos"."created_at" DESC  [["user_id", 6]]